//EXAMPLE   JOB  1,NOTIFY=&SYSUID
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..PHONE(IN),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD(OUT),DISP=SHR
// IF RC=0 THEN
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..PHONE(INFILE),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD(OUTFILE),DISP=SHR
// ENDIF