//EXAMPLE JOB 1,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..EXAMPLE(IN),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD(OUT),DISP=SHR
//GO    EXEC PGM=PROGRAM,PARM='&SYSUID'
//STEPLIB DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//LOANFILE DD DSN=&SYSUID..LOANNOEX,DISP=SHR

//OUTFILE   DD DSN=&SYSUID..OUTFILE,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=0),
//            SPACE=(CYL,(10,5))